Repository: illinoistech-itm/factor-front-end
Catalog: src/locale/messages.*.xlf
Languages: es

source: Username:
es: Usuario:

source: Email is required
es: Se requiere correo

source: Email must be a valid email address
es: Introduzca un correo válido

source: Password:
es: Contraseña:

source: Password is required
es: Se requiere contraseña

source: Password must be at least 5 characters
es: La contraseña debe de tener al menos 5 caracteres

source: Forgot Password?
es: ¿Olvidó su contraseña?

source: Upload Video
es: Subir video

source: Welcome professor {{userInfo.family_name}}, {{userInfo.given_name}}
es: Bienvenido profesor {{userInfo.family_name}}, {{userInfo.given_name}}

source: Please, upload your video following the next steps.
es: Por favor, suba el video siguiendo los siguientes pasos.

source: 1. Select Course:
es: 1. Selecione un curso:

source: Course is required
es: Se requiere seleccionar un curso

source: 2. Select Video:
es: 2. Seleccione un video:

source: Choose file
es: Elija un archivo

source: or drag and drop file here.
es: o arrastrelo hasta aqui.

source: Class video is required
es: Se requiere insertar un video de la clase

source: Class video must be in mp4 format
es: El video de la clase debe tener formato mp4.

source: List of courses to unfold and see files related and edit
es: Lista de curso para desplegar, ver los ficheros relaccionados y editar.

source: Your courses:
es: Tus cursos:

source: Name: {{video.name}}
es: Nombre:

source: Class number: {{video.class}}
es: Número de clase:

source: View
es: Ver

source: Search box filter by keywords on videos?
es: Buscardor por palabras clave de los videos?

source: Wait for been redirect
es: Espere a ser redirigido

source: create course!
es: Cree un curso!

source: Course name:
es: Nombre del curso:

source: Course number:
es: Número del curso:

source: Professor:
es: Profesor:

source: Add
es: Añadir

source: Add course to student/professor!
es: Añadir curso a un estudiante/profesor!

source: show users list with select to choose the user to change
es: Enseñar una lista de usuarios para elegir el usuario a cambiar

source: show list of courses to enroll
es: Mostrar los cursos en los que registrarse

source: User:
es: Usuario:

source: Courses:
es: Cursos:

source: Transcripts
es: Transcripciones

source: Show transcript complete
es: Mostrar la transcripción completa

source: Time
es: Tiempo

source: Word
es: Palabra

source: Edit
es: Editar

source: Show transcript table clickable for set video time
es: Mostrar una tabla de trascripciones en las que hacer click para mostrar ese momento en el video

source: Edit Transcripts
es: Editar transcripciones

source: Keywords
es: Palabras clave

source: edit-video works!
es: FUNCIONAA!

source: show video
es: mostrar video

source: delete button and return to prof
es: boton de borrado and volver a prof

source: change name
es: cambiar nombre

source: change transcripts
es: cambiar transcripciones

source: save and redirect to view of the video
es: guardar y redirigir a la vista del video

source: Logout (door)
es: Cerrar sesión (door)
